In [1]:
import pandas as pd
import numpy as np

In [4]:
stuff = {
    'Corporation':['Apple', 'Google', 'Meta', 'Apple', 'Google','Meta'],
    'Employees':['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary':[200, 220, 190, 130, 120, 150]}
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [19]:
# Create Function
def times1000(x):
    return format(x*1000, ',d') # https://www.w3schools.com/python/ref_string_format.asp

In [20]:
# Use apply function
pd.DataFrame(my_df['Salary'].apply(times1000))

    Salary
0  200,000
1  220,000
2  190,000
3  130,000
4  120,000
5  150,000

In [29]:
# Add Last Names
def namer(x):
    if x == 'John':
        return 'John Elder'
    else:
        return x

In [30]:
pd.DataFrame(my_df['Employees'].apply(namer))

    Employees
0  John Elder
1       April
2         Wes
3        Beth
4      Justin
5       Steph

In [34]:
# USE LAMBDA 
pd.DataFrame(my_df['Salary'].apply(lambda x: format(x*1000, ',d')))

    Salary
0  200,000
1  220,000
2  190,000
3  130,000
4  120,000
5  150,000